tap "felixkratz/formulae"
tap "schappim/ekctl"
tap "thdxg/tap"
tap "ttscoff/thelab"
brew "antidote"
brew "openssl@3"
brew "readline"
brew "xz"
brew "zstd"
brew "bash"
brew "bat"
brew "blueutil"
brew "cmake"
brew "cmatrix"
brew "daktilo"
brew "difftastic"
brew "direnv"
brew "duf"
brew "dust"
brew "dvc"
brew "eza"
brew "fakesteak"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "libb2"
brew "ghq"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "ical-buddy"
brew "ijq"
brew "imagemagick"
brew "imagemagick-full"
brew "jq"
brew "mdless"
brew "node"
brew "mermaid-cli"
brew "mosh"
brew "neovim"
brew "no-more-secrets"
brew "pandoc"
brew "poppler"
brew "procs"
brew "pyenv"
brew "pygments"
brew "ripgrep"
brew "sdl2"
brew "starship"
brew "stow"
brew "tcl-tk@8"
brew "telnet"
brew "tmux"
brew "typst"
brew "uv"
brew "yt-dlp"
brew "zlib"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "schappim/ekctl/ekctl"
brew "ttscoff/thelab/apex"
cask "basictex"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-tex-gyre-pagella"
cask "ghostty"
cask "inkscape"
cask "thdxg/tap/macterm"
cask "tex-live-utility"
cask "typora"
cask "visual-studio-code"
cask "wailbrew"
cask "wezterm"
vscode "github.copilot-chat"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
uv "arxiv-mcp-server"
uv "llm"
uv "marker-pdf"
uv "zotero-mcp", with: ["chromadb"]
uv "zotero-mcp-server", with: ["chromadb"]
npm "@modelcontextprotocol/server-brave-search"
npm "@tobilu/qmd"
npm "defuddle"
npm "llm-checker"
